v2512/run/verification-studies/diederichsen-and-hatton/template/0.orig/C_S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C_S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform {C_S0};

boundaryField
{
    surface
    {
        type            zeroGradient;
        value           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           uniform {C_S0};
    }
    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }
    "wedge.*"
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
        value           $internalField;
    }
}


// ************************************************************************* //
