v2512/run/verification-studies/diederichsen-and-hatton/template/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir
touch case.foam
runApplication blockMesh
runApplication $(getApplication)

./Allplot

#------------------------------------------------------------------------------